<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple Inc//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>PayloadDisplayName</key>
        <string>基于HTTPS加密的DNS</string>
        <key>PayloadVersion</key>
        <integer>1</integer>
        <key>PayloadDescription</key>
        <string>配置设备使用基于HTTPS加密的DNS</string>
        <key>PayloadUUID</key>
        <string>dc4d9c27-e5ba-4451-b158-5de81da47864</string>
        <key>PayloadType</key>
        <string>Configuration</string>
        <key>PayloadIdentifier</key>
        <string>com.blazesnow.dnsSettings</string>
        <key>PayloadContent</key>
        <array>
            <!-- 阿里云公共DNS -->
            <dict>
                <key>DNSSettings</key>
                <dict>
                    <key>AllowFailover</key>
                    <false />
                    <key>DNSProtocol</key>
                    <string>HTTPS</string>
                    <key>ServerAddresses</key>
                    <array>
                        <string>2400:3200::1</string>
                        <string>2400:3200:baba::1</string>
                        <string>223.5.5.5</string>
                        <string>223.6.6.6</string>
                    </array>
                    <key>ServerName</key>
                    <string>阿里云公共DNS</string>
                    <key>ServerURL</key>
                    <string>https://dns.alidns.com/dns-query</string>
                </dict>
                <key>PayloadDisplayName</key>
                <string>阿里云公共DNS</string>
                <key>PayloadVersion</key>
                <integer>1</integer>
                <key>PayloadDescription</key>
                <string>阿里云公共DNS</string>
                <key>PayloadUUID</key>
                <string>dcbca434-1e7e-4eba-8367-7af1e12109ff</string>
                <key>PayloadType</key>
                <string>com.apple.dnsSettings.managed</string>
                <key>PayloadOrganization</key>
                <string>alidns.com</string>
                <key>PayloadIdentifier</key>
                <string>com.blazesnow.dnsSettings.alidns</string>
            </dict>
            <!-- 360安全DNS -->
            <dict>
                <key>DNSSettings</key>
                <dict>
                    <key>AllowFailover</key>
                    <false />
                    <key>DNSProtocol</key>
                    <string>HTTPS</string>
                    <key>ServerAddresses</key>
                    <array>
                        <string>101.226.4.6</string>
                        <string>218.30.118.6</string>
                        <string>123.125.81.6</string>
                        <string>140.207.198.6</string>
                    </array>
                    <key>ServerName</key>
                    <string>360安全DNS</string>
                    <key>ServerURL</key>
                    <string>https://doh.360.cn/dns-query</string>
                </dict>
                <key>PayloadDisplayName</key>
                <string>360安全DNS</string>
                <key>PayloadVersion</key>
                <integer>1</integer>
                <key>PayloadDescription</key>
                <string>360安全DNS</string>
                <key>PayloadUUID</key>
                <string>11580305-f5f0-4b9b-9e0c-a97303102597</string>
                <key>PayloadType</key>
                <string>com.apple.dnsSettings.managed</string>
                <key>PayloadOrganization</key>
                <string>sdns.360.net</string>
                <key>PayloadIdentifier</key>
                <string>com.blazesnow.dnsSettings.360dns</string>
            </dict>
        </array>
    </dict>
</plist>